burakenez/gd32w51x-cmake-vscode/Drivers/GD32W51x_F5HC_standard_peripheral/Source/gd32w51x_f5hc_rcu.c
#if defined (GD32W515)
/*!
    \brief      configure the PLLDIG output clock frequency (API_ID(0x001BU))
    \param[in]  plldig_clk: the PLLDIG output clock frequency selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_PLLDIG_192M: selected 192Mhz as PLLDIG output frequency
      \arg        RCU_PLLDIG_240M: selected 240Mhz as PLLDIG output frequency
      \arg        RCU_PLLDIG_320M: selected 320Mhz as PLLDIG output frequency
      \arg        RCU_PLLDIG_480M: selected 480Mhz as PLLDIG output frequency
    \param[out] none
    \retval     none
*/
void rcu_plldig_config(uint32_t plldig_clk)
{
    RCU_PLLCFG &= ~(RCU_PLLCFG_PLLDIGOSEL);

    RCU_PLLCFG |= plldig_clk;
}

/*!
    \brief      configure PLLDIG clock divider factor for system clock (API_ID(0x001CU))
    \param[in]  plldig_div_sys: PLLDIG clock divider factor for system clock
                only one parameter can be selected which is shown as below:
      \arg        RCU_PLLDIG_SYS_DIVx(x=1,2,3,...,64): PLLDIG clock divided by x for system clock
    \param[out] none
    \retval     none
*/
void rcu_plldig_div_sys_config(uint32_t plldig_div_sys)
{
    uint32_t reg;

    reg = RCU_PLLCFG;
    /* reset the PLLDIGFSYSDIV bits and set according to plldigfsys_div */
    reg &= ~RCU_PLLCFG_PLLDIGDIV_SYS;
    RCU_PLLCFG = (reg | plldig_div_sys);
}
#endif /* GD32W515 */

/*!
    \brief      configure the RTC clock source selection (API_ID(0x001DU))
    \param[in]  rtc_clock_source: RTC clock source selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_RTCSRC_NONE: no clock selected
      \arg        RCU_RTCSRC_LXTAL: CK_LXTAL selected as RTC source clock
      \arg        RCU_RTCSRC_IRC32K: CK_IRC32K selected as RTC source clock
      \arg        RCU_RTCSRC_HXTAL_DIV_RTCDIV: CK_HXTAL/RTCDIV selected as RTC source clock
    \param[out] none
    \retval     none
*/
void rcu_rtc_clock_config(uint32_t rtc_clock_source)
{
    uint32_t reg;

    reg = RCU_BDCTL;
    /* reset the RTCSRC bits and set according to rtc_clock_source */
    reg &= ~RCU_BDCTL_RTCSRC;
    RCU_BDCTL = (reg | rtc_clock_source);
}

/*!
    \brief      configure the frequency division of RTC clock when HXTAL was selected as its clock source (API_ID(0x001EU))
    \param[in]  rtc_div: RTC clock frequency division
                only one parameter can be selected which is shown as below:
      \arg        RCU_RTC_HXTAL_NONE: no clock for RTC
      \arg        RCU_RTC_HXTAL_DIVx: RTCDIV clock select CK_HXTAL/x, x = 2....32
    \param[out] none
    \retval     none
*/
void rcu_rtc_div_config(uint32_t rtc_div)
{
    uint32_t reg;
    reg = RCU_CFG0;
    /* reset the RTCDIV bits and set according to rtc_div value */
    reg &= ~RCU_CFG0_RTCDIV;
    RCU_CFG0 = (reg | rtc_div);
}

/*!
    \brief      configure the I2S clock source selection (API_ID(0x001FU))
    \param[in]  i2s_clock_source: I2S clock source selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_I2SSRC_PLLI2S: CK_PLLI2S selected as I2S source clock
      \arg        RCU_I2SSRC_I2S_CKIN: external i2s_ckin pin selected as I2S source clock
      \arg        RCU_I2SSRC_I2S_PLLDIV: PLL division selected as I2S source clock
    \param[out] none
    \retval     none
*/
void rcu_i2s_clock_config(uint32_t i2s_clock_source)
{
    uint32_t reg;

    reg = RCU_ADDCTL;
    /* reset the I2SSEL bit and set according to i2s_clock_source */
    reg &= ~RCU_ADDCTL_I2SSEL;
    RCU_ADDCTL = (reg | i2s_clock_source);
}

/*!
    \brief      configure the PLL divider factor for I2S clock (API_ID(0x0020U))
    \param[in]  pll_div_i2s: PLL divider factor for I2S clock
                only one parameter can be selected which is shown as below:
      \arg        RCU_PLLDIV_I2S_DIVx(x=1,2,...,64): PLL clock divided by x for I2S clock
    \param[out] none
    \retval     none
*/
void rcu_pll_div_i2s_config(uint32_t pll_div_i2s)
{
    uint32_t reg;

    reg = RCU_ADDCTL;
    /* reset the PLLDIV_I2S bits and set according to pll_div_i2s */
    reg &= ~RCU_ADDCTL_PLLDIV_I2S;
    RCU_ADDCTL = (reg | pll_div_i2s);
}

#if defined (GD32W515)
/*!
    \brief      configure the hpdf clock source selection (API_ID(0x0021U))
    \param[in]  hpdf_clock_source: hpdf clock source selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_HPDFSRC_PCLK2: PCLK2 clock selected as HPDF source clock
      \arg        RCU_HPDFSRC_CKSYS: System clock selected as HPDF source clock
    \param[out] none
    \retval     none
*/
void rcu_hpdf_clock_config(uint32_t hpdf_clock_source)
{
    uint32_t reg;

    reg = RCU_ADDCTL;
    /* reset the HPDFSEL bit and set according to hpdf_clock_source */
    reg &= ~RCU_ADDCTL_HPDFSEL;
    RCU_ADDCTL = (reg | hpdf_clock_source);
}

/*!
    \brief      configure the HPDF AUDIO clock source selection (API_ID(0x0022U))
    \param[in]  hpdfaudio_clock_source: HPDF AUDIO clock source selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_HPDFAUDIOSRC_PLLI2S: PLLI2S output clock selected as HPDF AUDIO source clock
      \arg        RCU_HPDFAUDIOSRC_I2S_CKIN: external I2S_CKIN PIN selected as HPDF AUDIO source clock
      \arg        RCU_HPDFAUDIOSRC_PLL: PLL division selected as HPDF AUDIO source clock
      \arg        RCU_HPDFAUDIOSRC_IRC16M: IRC16M selected as HPDF AUDIO source clock
    \param[out] none
    \retval     none
*/
void rcu_hpdf_audio_clock_config(uint32_t hpdfaudio_clock_source)
{
    uint32_t reg;

    reg = RCU_ADDCTL;
    /* reset the HPDFAUDIOSEL bit and set according to hpdfaudio_clock_source */
    reg &= ~RCU_ADDCTL_HPDFAUDIOSEL;
    RCU_ADDCTL = (reg | hpdfaudio_clock_source);
}

/*!
    \brief      configure the SDIO clock source selection (API_ID(0x0023U))
    \param[in]  sdio_clock_source: SDIO clock source selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_SDIOSRC_PLL: PLL output clock selected as SDIO source clock
      \arg        RCU_SDIOSRC_PLLDIG: PLLDIG selected as SDIO source clock
      \arg        RCU_SDIOSRC_IRC16M: IRC16M selected as SDIO source clock
      \arg        RCU_SDIOSRC_HXTAL: HXTAL selected as SDIO source clock
    \param[out] none
    \retval     none
*/
void rcu_sdio_clock_config(uint32_t sdio_clock_source)
{
    uint32_t reg;

    reg = RCU_ADDCTL;
    /* reset the SDIOSEL bit and set according to sdio_clock_source */
    reg &= ~(RCU_SDIOSRC_MASK);
    RCU_ADDCTL = (reg | sdio_clock_source);
}

/*!
    \brief      configure the frequency division of the sdio source clock (API_ID(0x0024U))
    \param[in]  sdio_div: SDIO clock frequency division
                only one parameter can be selected which is shown as below:
      \arg        RCU_SDIODIV_DIVx: SDIODIV input source clock divided by x, x = 1,...,32
    \param[out] none
    \retval     none
*/
void rcu_sdio_div_config(uint32_t sdio_div)
{
    uint32_t reg;
    reg = RCU_ADDCTL;
    /* reset the SDIODIV bits and set according to sdio_div value */
    reg &= ~RCU_ADDCTL_SDIODIV;
    RCU_ADDCTL = (reg | sdio_div);
}
#endif /* GD32W515 */

/*!
    \brief      configure the USBFS clock source selection (API_ID(0x0025U))
    \param[in]  usbfs_clock_source: USBFS clock source selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_USBFSSRC_PLL: PLL clock selected as USB source clock
      \arg        RCU_USBFSSRC_IRC48M: IRC48M clock selected as USB source clock (only for GD32F5HC)
    \param[out] none
    \retval     none
*/
void rcu_usbfs_clock_config(uint32_t usbfs_clock_source)
{
    uint32_t reg;

    reg = RCU_ADDCTL;
    /* reset the USBFSSEL bit and set according to usbfs_clock_source */
    reg &= ~RCU_ADDCTL_USBFSSEL;
    RCU_ADDCTL = (reg | usbfs_clock_source);
}

/*!
    \brief      configure the frequency division of the usbfs source clock (API_ID(0x0026U))
    \param[in]  usbfs_div: USBFS clock frequency division
                only one parameter can be selected which is shown as below:
      \arg        RCU_USBFS_DIVx: USBFSDIV input source clock divided by x, x = 1....32
    \param[out] none
    \retval     none
*/
void rcu_usbfs_div_config(uint32_t usbfs_div)
{
    uint32_t reg;
    reg = RCU_ADDCTL;
    /* reset the USBFSDIV bits and set according to usbfs_div value */
    reg &= ~RCU_ADDCTL_USBFSDIV;
    RCU_ADDCTL = (reg | usbfs_div);
}

/*!
    \brief      configure the I2C0 clock source selection (API_ID(0x0027U))
    \param[in]  i2c0_clock_source: I2C0 clock source selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_I2C0SRC_CKAPB1: CK_APB1 selected as I2C0 source clock
      \arg        RCU_I2C0SRC_CKSYS: CK_SYS selected as I2C0 source clock
      \arg        RCU_I2C0SRC_IRC16M: CK_IRC16M selected as I2C0 source clock
    \param[out] none
    \retval     none
*/
void rcu_i2c0_clock_config(uint32_t i2c0_clock_source)
{
    uint32_t reg;

