burakenez/gd32w51x-cmake-vscode/Drivers/GD32W51x_F5HC_standard_peripheral/Source/gd32w51x_f5hc_rcu.c
    reg = RCU_CFG1;
    /* reset the I2C0SEL bit and set according to i2c0_clock_source */
    reg &= ~RCU_CFG1_I2C0SEL;
    RCU_CFG1 = (reg | i2c0_clock_source);
}
#if defined (GD32F5HC)
/*!
    \brief      configure the I2C1 clock source selection (API_ID(0x0028U))
    \param[in]  i2c1_clock_source: I2C1 clock source selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_I2C1SRC_CKAPB1: CK_APB1 selected as I2C1 source clock
      \arg        RCU_I2C1SRC_CKSYS: CK_SYS selected as I2C1 source clock
      \arg        RCU_I2C1SRC_IRC16M: CK_IRC16M selected as I2C1 source clock
    \param[out] none
    \retval     none
*/
void rcu_i2c1_clock_config(uint32_t i2c1_clock_source)
{
    uint32_t reg;

    reg = RCU_CFG1;
    /* reset the I2C1SEL bit and set according to i2c1_clock_source */
    reg &= ~RCU_CFG1_I2C1SEL;
    RCU_CFG1 = (reg | i2c1_clock_source);
}
#endif

/*!
    \brief      configure the USART0 clock source selection (API_ID(0x0029U))
    \param[in]  usart0_clock_source: USART0 clock source selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_USART0SRC_CKAPB1: CK_APB1 selected as USART0 source clock
      \arg        RCU_USART0SRC_CKSYS: CK_SYS selected as USART0 source clock
      \arg        RCU_USART0SRC_LXTAL: CK_LXTAL selected as USART0 source clock
      \arg        RCU_USART0SRC_IRC16M: CK_IRC16M selected as USART0 source clock
    \param[out] none
    \retval     none
*/
void rcu_usart0_clock_config(uint32_t usart0_clock_source)
{
    uint32_t reg;

    reg = RCU_CFG1;
    /* reset the USART0SEL bit and set according to usart0_clock_source */
    reg &= ~RCU_CFG1_USART0SEL;
    RCU_CFG1 = (reg | usart0_clock_source);
}

/*!
    \brief      configure the USART2 clock source selection (API_ID(0x002AU))
    \param[in]  usart2_clock_source: USART2 clock source selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_USART2SRC_CKAPB2: CK_APB2 selected as USART2 source clock
      \arg        RCU_USART2SRC_CKSYS: CK_SYS selected as USART2 source clock
      \arg        RCU_USART2SRC_LXTAL: CK_LXTAL selected as USART2 source clock
      \arg        RCU_USART2SRC_IRC16M: CK_IRC16M selected as USART2 source clock
    \param[out] none
    \retval     none
*/
void rcu_usart2_clock_config(uint32_t usart2_clock_source)
{
    uint32_t reg;

    reg = RCU_CFG1;
    /* reset the USART2SEL bit and set according to usart2_clock_source */
    reg &= ~RCU_CFG1_USART2SEL;
    RCU_CFG1 = (reg | usart2_clock_source);
}

/*!
    \brief      configure IRC16M clock divider factor for system clock (API_ID(0x002BU))
    \param[in]  irc16m_div: IRC16M clock divider factor for system clock
                only one parameter can be selected which is shown as below:
      \arg        RCU_IRC16M_DIVx(x=1,2,3,...,512): IRC16M clock divided by x for system clock
    \param[out] none
    \retval     none
*/
void rcu_irc16m_div_config(uint32_t irc16m_div)
{
    uint32_t reg;
    reg = RCU_CFG1;
    /* reset the IRC16MDIV bits and set according to irc16m_div */
    reg &= ~RCU_CFG1_IRC16MDIV;
    RCU_CFG1 = (reg | irc16m_div);
}

/*!
    \brief      configure the TIMER clock prescaler selection (API_ID(0x002CU))
    \param[in]  timer_clock_prescaler: TIMER clock selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_TIMER_PSC_MUL2: if APB1PSC/APB2PSC in RCU_CFG0 register is 0b0xx(CK_APBx = CK_AHB)
                                      or 0b100(CK_APBx = CK_AHB/2), the TIMER clock is equal to CK_AHB(CK_TIMERx = CK_AHB).
                                      or else, the TIMER clock is twice the corresponding APB clock (TIMER in APB1 domain: CK_TIMERx = 2 x CK_APB1;
                                      TIMER in APB2 domain: CK_TIMERx = 2 x CK_APB2)
      \arg        RCU_TIMER_PSC_MUL4: if APB1PSC/APB2PSC in RCU_CFG0 register is 0b0xx(CK_APBx = CK_AHB),
                                      0b100(CK_APBx = CK_AHB/2), or 0b101(CK_APBx = CK_AHB/4), the TIMER clock is equal to CK_AHB(CK_TIMERx = CK_AHB).
                                      or else, the TIMER clock is four timers the corresponding APB clock (TIMER in APB1 domain: CK_TIMERx = 4 x CK_APB1;
                                      TIMER in APB2 domain: CK_TIMERx = 4 x CK_APB2)
    \param[out] none
    \retval     none
*/
void rcu_timer_clock_prescaler_config(uint32_t timer_clock_prescaler)
{
    /* configure the TIMERSEL bit and select the TIMER clock prescaler */
    if(timer_clock_prescaler == RCU_TIMER_PSC_MUL2) {
        RCU_CFG1 &= timer_clock_prescaler;
    } else {
        RCU_CFG1 |= timer_clock_prescaler;
    }
}

/*!
    \brief      configure the LXTAL drive capability (API_ID(0x002DU))
    \param[in]  lxtal_dricap: drive capability of LXTAL
                only one parameter can be selected which is shown as below:
      \arg        RCU_LXTALDRI_LOWER_DRIVE: lower driving capability
      \arg        RCU_LXTALDRI_HIGH_DRIVE: high driving capability
      \arg        RCU_LXTALDRI_HIGHER_DRIVE: higher driving capability
      \arg        RCU_LXTALDRI_HIGHEST_DRIVE: highest driving capability
    \param[out] none
    \retval     none
*/
void rcu_lxtal_drive_capability_config(uint32_t lxtal_dricap)
{
    uint32_t reg;

    reg = RCU_BDCTL;

    /* reset the LXTALDRI bits and set according to lxtal_dricap */
    reg &= ~RCU_BDCTL_LXTALDRI;
    RCU_BDCTL = (reg | lxtal_dricap);
}

/*!
    \brief      wait for oscillator stabilization flags is SET or oscillator startup is timeout (API_ID(0x002EU))
    \param[in]  osci: oscillator types, refer to rcu_osci_type_enum
                only one parameter can be selected which is shown as below:
      \arg        RCU_HXTAL: HXTAL
      \arg        RCU_LXTAL: LXTAL
      \arg        RCU_IRC16M: IRC16M
      \arg        RCU_IRC48M: IRC48M (only for GD32F5HC)
      \arg        RCU_IRC32K: IRC32K
      \arg        RCU_PLL_CK: PLL
      \arg        RCU_PLLDIG_CK: PLLDIG (only for GD32W515)
      \arg        RCU_PLLI2S_CK: PLLI2S
    \param[out] none
    \retval     ErrStatus: SUCCESS or ERROR
    \note       This function may contain scenarios leading to an infinite loop.
                Modify it according to the actual usage requirements.
*/
ErrStatus rcu_osci_stab_wait(rcu_osci_type_enum osci)
{
    uint32_t stb_cnt = 0U;
    ErrStatus reval = ERROR;
    FlagStatus osci_stat = RESET;

    switch(osci) {
        /* wait HXTAL stable */
        case RCU_HXTAL:
            while((RESET == osci_stat) && (HXTAL_STARTUP_TIMEOUT != stb_cnt)) {
                osci_stat = rcu_flag_get(RCU_FLAG_HXTALSTB);
                stb_cnt++;
            }

            /* check whether flag is set */
            if(RESET != rcu_flag_get(RCU_FLAG_HXTALSTB)) {
                reval = SUCCESS;
            }
            break;
        /* wait LXTAL stable */
        case RCU_LXTAL:
            while((RESET == osci_stat) && (LXTAL_STARTUP_TIMEOUT != stb_cnt)) {
                osci_stat = rcu_flag_get(RCU_FLAG_LXTALSTB);
                stb_cnt++;
            }

            /* check whether flag is set */
            if(RESET != rcu_flag_get(RCU_FLAG_LXTALSTB)) {
                reval = SUCCESS;
            }
            break;
        /* wait IRC16M stable */
        case RCU_IRC16M:
            while((RESET == osci_stat) && (IRC16M_STARTUP_TIMEOUT != stb_cnt)) {
                osci_stat = rcu_flag_get(RCU_FLAG_IRC16MSTB);
                stb_cnt++;
            }

            /* check whether flag is set */
            if(RESET != rcu_flag_get(RCU_FLAG_IRC16MSTB)) {
                reval = SUCCESS;
            }
            break;
        /* wait IRC32K stable */
        case RCU_IRC32K:
            while((RESET == osci_stat) && (OSC_STARTUP_TIMEOUT != stb_cnt)) {
                osci_stat = rcu_flag_get(RCU_FLAG_IRC32KSTB);
                stb_cnt++;
            }

            /* check whether flag is set */
            if(RESET != rcu_flag_get(RCU_FLAG_IRC32KSTB)) {
                reval = SUCCESS;
            }
            break;
        /* wait PLL stable */
        case RCU_PLL_CK:
            while((RESET == osci_stat) && (OSC_STARTUP_TIMEOUT != stb_cnt)) {
                osci_stat = rcu_flag_get(RCU_FLAG_PLLSTB);
                stb_cnt++;
            }

            /* check whether flag is set */
            if(RESET != rcu_flag_get(RCU_FLAG_PLLSTB)) {
                reval = SUCCESS;
            }
            break;
        /* wait PLLI2S stable */
        case RCU_PLLI2S_CK:
            while((RESET == osci_stat) && (OSC_STARTUP_TIMEOUT != stb_cnt)) {
                osci_stat = rcu_flag_get(RCU_FLAG_PLLI2SSTB);
                stb_cnt++;
            }

            /* check whether flag is set */
            if(RESET != rcu_flag_get(RCU_FLAG_PLLI2SSTB)) {
                reval = SUCCESS;
            }
            break;
#if defined (GD32W515)
        /* wait PLLDIG stable */
        case RCU_PLLDIG_CK:
            while((RESET == osci_stat) && (OSC_STARTUP_TIMEOUT != stb_cnt)) {
                osci_stat = rcu_flag_get(RCU_FLAG_PLLDIGSTB);
                stb_cnt++;
            }

            /* check whether flag is set */
            if(RESET != rcu_flag_get(RCU_FLAG_PLLDIGSTB)) {
                reval = SUCCESS;
            }
            break;
#endif
#if defined (GD32F5HC)
        /* wait IRC48M stable */
        case RCU_IRC48M:
            while((RESET == osci_stat) && (IRC48M_STARTUP_TIMEOUT != stb_cnt)) {
                osci_stat = rcu_flag_get(RCU_FLAG_IRC48MSTB);
                stb_cnt++;
            }

            /* check whether flag is set */
            if(RESET != rcu_flag_get(RCU_FLAG_IRC48MSTB)) {
                reval = SUCCESS;
            }
            break;
#endif
        default:
            break;
    }

    /* return value */
    return reval;
}

/*!
    \brief      turn on the oscillator (API_ID(0x002FU))
    \param[in]  osci: oscillator types, refer to rcu_osci_type_enum
                only one parameter can be selected which is shown as below:
      \arg        RCU_HXTAL: HXTAL
      \arg        RCU_LXTAL: LXTAL
      \arg        RCU_IRC16M: IRC16M
      \arg        RCU_IRC32K: IRC32K
      \arg        RCU_PLLDIG_CK: PLLDIG (only for GD32W515)
      \arg        RCU_PLL_CK: PLL
      \arg        RCU_PLLI2S_CK: PLLI2S
      \arg        RCU_IRC48M: IRC48M (only for GD32F5HC)
    \param[out] none
    \retval     none
*/
void rcu_osci_on(rcu_osci_type_enum osci)
{
    RCU_REG_VAL(osci) |= BIT(RCU_BIT_POS(osci));
}

/*!
    \brief      turn off the oscillator (API_ID(0x0030U))
    \param[in]  osci: oscillator types, refer to rcu_osci_type_enum
                only one parameter can be selected which is shown as below:
      \arg        RCU_HXTAL: HXTAL
      \arg        RCU_LXTAL: LXTAL
      \arg        RCU_IRC16M: IRC16M
      \arg        RCU_IRC32K: IRC32K
      \arg        RCU_PLLDIG_CK: PLLDIG (only for GD32W515)
      \arg        RCU_PLL_CK: PLL
      \arg        RCU_PLLI2S_CK: PLLI2S
      \arg        RCU_IRC48M: IRC48M (only for GD32F5HC)
    \param[out] none
    \retval     none
*/
void rcu_osci_off(rcu_osci_type_enum osci)
{
    RCU_REG_VAL(osci) &= ~BIT(RCU_BIT_POS(osci));
}

/*!
    \brief      enable the oscillator bypass mode, HXTALEN or LXTALEN must be reset before it (API_ID(0x0031U))
    \param[in]  osci: oscillator types, refer to rcu_osci_type_enum
                only one parameter can be selected which is shown as below:
      \arg        RCU_HXTAL: high speed crystal oscillator(HXTAL)
      \arg        RCU_LXTAL: low speed crystal oscillator(LXTAL)
    \param[out] none
    \retval     none
*/
void rcu_osci_bypass_mode_enable(rcu_osci_type_enum osci)
{
    uint32_t reg;

    switch(osci) {
        /* enable HXTAL to bypass mode */
        case RCU_HXTAL:
            RCU_CTL &= ~RCU_CTL_HXTALEN;
            RCU_CTL |= RCU_CTL_HXTALBPS;
            break;
        /* enable LXTAL to bypass mode */
        case RCU_LXTAL:
            reg = RCU_BDCTL;
            RCU_BDCTL &= ~RCU_BDCTL_LXTALEN;
            RCU_BDCTL = (reg | RCU_BDCTL_LXTALBPS);
            break;
        case RCU_IRC16M:
        case RCU_IRC32K:
        case RCU_PLL_CK:
        case RCU_PLLI2S_CK:
            break;
        default:
            break;
    }
}

/*!
    \brief      disable the oscillator bypass mode, HXTALEN or LXTALEN must be reset before it (API_ID(0x0032U))
    \param[in]  osci: oscillator types, refer to rcu_osci_type_enum
                only one parameter can be selected which is shown as below:
      \arg        RCU_HXTAL: high speed crystal oscillator(HXTAL)
      \arg        RCU_LXTAL: low speed crystal oscillator(LXTAL)
    \param[out] none
    \retval     none
*/
void rcu_osci_bypass_mode_disable(rcu_osci_type_enum osci)
{
    uint32_t reg;

    switch(osci) {
        /* disable HXTAL to bypass mode */
        case RCU_HXTAL:
            reg = RCU_CTL;
            RCU_CTL &= ~RCU_CTL_HXTALEN;
            RCU_CTL = (reg & ~RCU_CTL_HXTALBPS);
            break;
        /* disable LXTAL to bypass mode */
        case RCU_LXTAL:
            reg = RCU_BDCTL;
            RCU_BDCTL &= ~RCU_BDCTL_LXTALEN;
            RCU_BDCTL = (reg & ~RCU_BDCTL_LXTALBPS);
            break;
        case RCU_IRC16M:
        case RCU_IRC32K:
        case RCU_PLL_CK:
        case RCU_PLLI2S_CK:
            break;
        default:
            break;
    }
}

/*!
    \brief      set the IRC16M adjust value (API_ID(0x0033U))
    \param[in]  irc16m_adjval: IRC16M adjust value, must be between 0 and 0x1F
      \arg        0x00 - 0x1F
    \param[out] none
    \retval     none
*/
void rcu_irc16m_adjust_value_set(uint32_t irc16m_adjval)
{
    uint32_t reg;

    reg = RCU_CTL;
    /* reset the IRC16MADJ bits and set according to irc16m_adjval */
    reg &= ~RCU_CTL_IRC16MADJ;
    RCU_CTL = (reg | ((irc16m_adjval & RCU_IRC16M_ADJUST_MASK) << RCU_IRC16M_ADJUST_OFFSET));
}

/*!
    \brief      configure the spread spectrum modulation for the main PLL clock (API_ID(0x0034U))
    \param[in]  spread_spectrum_type: PLL spread spectrum modulation type select
      \arg        RCU_SS_TYPE_CENTER: center spread type is selected
      \arg        RCU_SS_TYPE_DOWN: down spread type is selected
    \param[in]  modstep: configure PLL spread spectrum modulation profile amplitude and frequency
      \arg        This parameter should be selected between 0 and 7FFF.The following criteria must be met: MODSTEP*MODCNT <=2^15-1
    \param[in]  modcnt: configure PLL spread spectrum modulation profile amplitude and frequency
      \arg        This parameter should be selected between 0 and 1FFF.The following criteria must be met: MODSTEP*MODCNT <=2^15-1
    \param[out] none
    \retval     none
*/
void rcu_spread_spectrum_config(uint32_t spread_spectrum_type, uint32_t modstep, uint32_t modcnt)
{
    uint32_t reg;

    reg = RCU_PLLSSCTL;
    /* reset the RCU_PLLSSCTL register bits */
    reg &= ~(RCU_PLLSSCTL_MODCNT | RCU_PLLSSCTL_MODSTEP | RCU_PLLSSCTL_SS_TYPE);
    RCU_PLLSSCTL = (reg | spread_spectrum_type | modstep << 13 | modcnt);
}

/*!
    \brief      enable the PLL spread spectrum modulation (API_ID(0x0035U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void rcu_spread_spectrum_enable(void)
{
    RCU_PLLSSCTL |= RCU_PLLSSCTL_SSCGON;
}

/*!
    \brief      disable the PLL spread spectrum modulation (API_ID(0x0036U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void rcu_spread_spectrum_disable(void)
{
    RCU_PLLSSCTL &= ~RCU_PLLSSCTL_SSCGON;
}

/*!
    \brief      enable the HXTAL clock monitor (API_ID(0x0037U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void rcu_hxtal_clock_monitor_enable(void)
{
    RCU_CTL |= RCU_CTL_CKMEN;
}

/*!
    \brief      disable the HXTAL clock monitor (API_ID(0x0038U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void rcu_hxtal_clock_monitor_disable(void)
{
    RCU_CTL &= ~RCU_CTL_CKMEN;
}

