burakenez/gd32w51x-cmake-vscode/Drivers/GD32W51x_F5HC_standard_peripheral/Source/gd32w51x_f5hc_rcu.c
#if defined (GD32W515)
/*!
    \brief      enable the RF HXTAL clock monitor (API_ID(0x0039U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void rcu_rf_hxtal_clock_monitor_enable(void)
{
    RCU_CTL |= RCU_CTL_RFCKMEN;
}

/*!
    \brief      disable the RF HXTAL clock monitor (API_ID(0x003AU))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void rcu_rf_hxtal_clock_monitor_disable(void)
{
    RCU_CTL &= ~RCU_CTL_RFCKMEN;
}

/*!
    \brief      unlock the voltage key (API_ID(0x003BU))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void rcu_voltage_key_unlock(void)
{
    RCU_VKEY = RCU_VKEY_UNLOCK;
}

/*!
    \brief      deep-sleep mode voltage select (API_ID(0x003CU))
    \param[in]  dsvol: deep sleep mode voltage
                only one parameter can be selected which is shown as below:
      \arg        RCU_DEEPSLEEP_V_1_1: the core voltage is 1.1V
      \arg        RCU_DEEPSLEEP_V_1_0: the core voltage is 1.0V
      \arg        RCU_DEEPSLEEP_V_0_9: the core voltage is 0.9V
      \arg        RCU_DEEPSLEEP_V_0_8: the core voltage is 0.8V
    \param[out] none
    \retval     none
*/
void rcu_deepsleep_voltage_set(uint32_t dsvol)
{
    dsvol &= RCU_DSV_DSLPVS;
    RCU_DSV = dsvol;
}
#endif /* GD32W515 */

/*!
    \brief      get the system clock, bus and peripheral clock frequency (API_ID(0x003DU))
    \param[in]  clock: the clock frequency which to get
                only one parameter can be selected which is shown as below:
      \arg        CK_SYS: system clock frequency
      \arg        CK_AHB: AHB clock frequency
      \arg        CK_APB1: APB1 clock frequency
      \arg        CK_APB2: APB2 clock frequency
      \arg        CK_USART0: USART0 clock frequency
      \arg        CK_USART2: USART2 clock frequency
      \arg        CK_I2C0: I2C0 clock frequency
      \arg        CK_I2C1: I2C1 clock frequency(GD32F5HC)
    \param[out] none
    \retval     clock frequency of system, AHB, APB1, APB2
*/
uint32_t rcu_clock_freq_get(rcu_clock_freq_enum clock)
{
    uint32_t sws, ck_freq = 0U;
    uint32_t cksys_freq, ahb_freq, apb1_freq, apb2_freq;
    uint32_t usart2_freq = 0U, usart0_freq = 0U, i2c0_freq = 0U;
#if defined (GD32F5HC)
    uint32_t i2c1_freq = 0U;
#endif
    uint32_t pllpsc, plln, pllsel, pllp, ck_src, idx, clk_exp;

    /* exponent of AHB, APB1 and APB2 clock divider */
    const uint8_t ahb_exp[16] = {0, 0, 0, 0, 0, 0, 0, 0, 1, 2, 3, 4, 6, 7, 8, 9};
    const uint8_t apb1_exp[8] = {0, 0, 0, 0, 1, 2, 3, 4};
    const uint8_t apb2_exp[8] = {0, 0, 0, 0, 1, 2, 3, 4};

    sws = GET_BITS(RCU_CFG0, 2, 3);
    switch(sws) {
        /* IRC16M is selected as CK_SYS */
        case SEL_IRC16M:
            cksys_freq = IRC16M_VALUE;
            break;
        /* HXTAL is selected as CK_SYS */
        case SEL_HXTAL:
            cksys_freq = HXTAL_VALUE;
            break;
#if defined (GD32F5HC)
        /* IRC48M is selected as CK_SYS */
        case SEL_IRC48M:
            cksys_freq = IRC48M_VALUE;
            break;
#endif
        /* PLLP is selected as CK_SYS */
        case SEL_PLLP:
            /* get the value of PLLPSC[5:0] */
            pllpsc = GET_BITS(RCU_PLL, 0U, 5U);
            plln = GET_BITS(RCU_PLL, 6U, 14U);
            pllp = (GET_BITS(RCU_PLL, 16U, 17U) + 1U) * 2U;

#if defined (GD32F5HC)
            /* PLL clock source selection, HXTAL or IRC16M */
            pllsel = (RCU_PLL & (RCU_PLL_PLLSEL | RCU_PLL_PLLSEL_1));
            if(RCU_PLLSRC_HXTAL == pllsel) {
                ck_src = HXTAL_VALUE;
            } else if(RCU_PLLSRC_IRC16M == pllsel){
                ck_src = IRC16M_VALUE;
            } else{
                ck_src = IRC48M_VALUE;
            }
#else
            /* PLL clock source selection, HXTAL or IRC16M */
            pllsel = (RCU_PLL & RCU_PLL_PLLSEL);
            if (RCU_PLLSRC_HXTAL == pllsel) {
                ck_src = HXTAL_VALUE;
            } else {
                ck_src = IRC16M_VALUE;
            }
#endif
            cksys_freq = ((ck_src / pllpsc) * plln) / pllp;
            break;
        /* IRC16M is selected as CK_SYS */
        default:
            cksys_freq = IRC16M_VALUE;
            break;
    }
    /* calculate AHB clock frequency */
    idx = GET_BITS(RCU_CFG0, 4, 7);
    clk_exp = ahb_exp[idx];
    ahb_freq = cksys_freq >> clk_exp;

    /* calculate APB1 clock frequency */
    idx = GET_BITS(RCU_CFG0, 10, 12);
    clk_exp = apb1_exp[idx];
    apb1_freq = ahb_freq >> clk_exp;

    /* calculate APB2 clock frequency */
    idx = GET_BITS(RCU_CFG0, 13, 15);
    clk_exp = apb2_exp[idx];
    apb2_freq = ahb_freq >> clk_exp;

    /* return the clocks frequency */
    switch(clock) {
        case CK_SYS:
            ck_freq = cksys_freq;
            break;
        case CK_AHB:
            ck_freq = ahb_freq;
            break;
        case CK_APB1:
            ck_freq = apb1_freq;
            break;
        case CK_APB2:
            ck_freq = apb2_freq;
            break;
        case CK_USART0:
            /* calculate USART0 clock frequency */
            if(RCU_USART0SRC_CKAPB1 == (RCU_CFG1 & RCU_CFG1_USART0SEL)) {
                usart0_freq = apb1_freq;
            } else if(RCU_USART0SRC_CKSYS == (RCU_CFG1 & RCU_CFG1_USART0SEL)) {
                usart0_freq = cksys_freq;
            } else if(RCU_USART0SRC_LXTAL == (RCU_CFG1 & RCU_CFG1_USART0SEL)) {
                usart0_freq = LXTAL_VALUE;
            } else if(RCU_USART0SRC_IRC16M == (RCU_CFG1 & RCU_CFG1_USART0SEL)) {
                usart0_freq = IRC16M_VALUE;
            } else {
            }
            ck_freq = usart0_freq;
            break;
        case CK_USART2:
            /* calculate USART2 clock frequency */
            if(RCU_USART2SRC_CKAPB2 == (RCU_CFG1 & RCU_CFG1_USART2SEL)) {
                usart2_freq = apb2_freq;
            } else if(RCU_USART2SRC_CKSYS == (RCU_CFG1 & RCU_CFG1_USART2SEL)) {
                usart2_freq = cksys_freq;
            } else if(RCU_USART2SRC_LXTAL == (RCU_CFG1 & RCU_CFG1_USART2SEL)) {
                usart2_freq = LXTAL_VALUE;
            } else if(RCU_USART2SRC_IRC16M == (RCU_CFG1 & RCU_CFG1_USART2SEL)) {
                usart2_freq = IRC16M_VALUE;
            } else {
            }
            ck_freq = usart2_freq;
            break;
        case CK_I2C0:
            /* calculate I2C0 clock frequency */
            if(RCU_I2C0SRC_CKAPB1 == (RCU_CFG1 & RCU_CFG1_I2C0SEL)) {
                i2c0_freq = apb1_freq;
            } else if(RCU_I2C0SRC_CKSYS == (RCU_CFG1 & RCU_CFG1_I2C0SEL)) {
                i2c0_freq = cksys_freq;
            } else if(RCU_I2C0SRC_IRC16M == (RCU_CFG1 & RCU_CFG1_I2C0SEL)) {
                i2c0_freq = IRC16M_VALUE;
            } else {
            }
            ck_freq = i2c0_freq;
            break;
#if defined (GD32F5HC)
        case CK_I2C1:
            /* calculate I2C1 clock frequency */
            if(RCU_I2C1SRC_CKAPB1 == (RCU_CFG1 & RCU_CFG1_I2C1SEL)) {
                i2c1_freq = apb1_freq;
            } else if(RCU_I2C1SRC_CKSYS == (RCU_CFG1 & RCU_CFG1_I2C1SEL)) {
                i2c1_freq = cksys_freq;
            } else if(RCU_I2C1SRC_IRC16M == (RCU_CFG1 & RCU_CFG1_I2C1SEL)) {
                i2c1_freq = IRC16M_VALUE;
            } else {
            }
            ck_freq = i2c1_freq;
            break;
#endif
        default:
            break;
    }
    return ck_freq;
}

/*!
    \brief      enable the security attribution (API_ID(0x003EU))
    \param[in]  security: clock security attribution, refer to rcu_sec_enum
                Only one parameter can be selected which is shown as below:
      \arg        RCU_SEC_IRC16MSEC: IRC16M clock configuration and status bits security
      \arg        RCU_SEC_HXTALSEC: HXTAL clock configuration and status bits security
      \arg        RCU_SEC_IRC32KSEC: IRC32K clock configuration and status bits security
      \arg        RCU_SEC_LXTALSEC: LXTAL clock configuration and status bits security
      \arg        RCU_SEC_SYSCLKSEC: SYSCLK clock selection, STOPWUCK bit, clock output on MCO configuration
      \arg        RCU_SEC_PRESCSEC: AHBx/APBx prescaler configuration bits security
      \arg        RCU_SEC_PLLSEC: main PLL configuration and status bits security
      \arg        RCU_SEC_PLLDIGSEC: PLLDIG configuration and status bits security (only for GD32W515)
      \arg        RCU_SEC_PLLI2SSEC: PLLI2S configuration and status bits security
      \arg        RCU_SEC_RMVRSTFSEC: remove reset flag security
      \arg        RCU_SEC_BKPSEC: BKP security
      \arg        RCU_SEC_IRC48MSEC: IRC48M clock configuration and status bits security (only for GD32F5HC)
    \param[out] none
    \retval     none
*/
void rcu_security_enable(rcu_sec_enum security)
{
    RCU_REG_VAL(security) |= BIT(RCU_BIT_POS(security));
}
/*!
    \brief      disable the security attribution (API_ID(0x003FU))
    \param[in]  security: clock security attribution, refer to rcu_sec_enum
                Only one parameter can be selected which is shown as below:
      \arg        RCU_SEC_IRC16MSEC: IRC16M clock configuration and status bits security
      \arg        RCU_SEC_HXTALSEC: HXTAL clock configuration and status bits security
      \arg        RCU_SEC_IRC32KSEC: IRC32K clock configuration and status bits security
      \arg        RCU_SEC_LXTALSEC: LXTAL clock configuration and status bits security
      \arg        RCU_SEC_SYSCLKSEC: SYSCLK clock selection, STOPWUCK bit, clock output on MCO configuration
      \arg        RCU_SEC_PRESCSEC: AHBx/APBx prescaler configuration bits security
      \arg        RCU_SEC_PLLSEC: main PLL configuration and status bits security
      \arg        RCU_SEC_PLLDIGSEC: PLLDIG configuration and status bits security (only for GD32W515)
      \arg        RCU_SEC_PLLI2SSEC: PLLI2S configuration and status bits security
      \arg        RCU_SEC_RMVRSTFSEC: remove reset flag security
      \arg        RCU_SEC_BKPSEC: BKP security
      \arg        RCU_SEC_IRC48MSEC: IRC48M clock configuration and status bits security (only for GD32F5HC)
    \param[out] none
    \retval     none
*/
void rcu_security_disable(rcu_sec_enum security)
{
    RCU_REG_VAL(security) &= ~BIT(RCU_BIT_POS(security));
}

/*!
    \brief      enable the privileged access (API_ID(0x0040U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void rcu_privilege_enable(void)
{
    RCU_CTL |= RCU_CTL_RCUPRIP;
}
/*!
    \brief      disable the privileged access (API_ID(0x0041U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void rcu_privilege_disable(void)
{
    RCU_CTL &= ~RCU_CTL_RCUPRIP;
}

/*!
    \brief      get the clock stabilization and periphral reset flags (API_ID(0x0042U))
    \param[in]  flag: the clock stabilization and periphral reset flags, refer to rcu_flag_enum
                only one parameter can be selected which is shown as below:
      \arg        RCU_FLAG_IRC16MSTB: IRC16M stabilization flag
      \arg        RCU_FLAG_HXTALSTB: HXTAL stabilization flag
      \arg        RCU_FLAG_PLLSTB: PLL stabilization flag
      \arg        RCU_FLAG_PLLI2SSTB: PLLI2S stabilization flag
      \arg        RCU_FLAG_PLLDIGSTB: PLLDIG stabilization flag (only for GD32W515)
      \arg        RCU_FLAG_LXTALSTB: LXTAL stabilization flag
      \arg        RCU_FLAG_IRC32KSTB: IRC32K stabilization flag
      \arg        RCU_FLAG_OBLRST: option byte loader reset flags
      \arg        RCU_FLAG_EPRST: external PIN reset flag
      \arg        RCU_FLAG_PORRST: power reset flag
      \arg        RCU_FLAG_SWRST: software reset flag
      \arg        RCU_FLAG_FWDGTRST: free watchdog timer reset flag
      \arg        RCU_FLAG_WWDGTRST: window watchdog timer reset flag
      \arg        RCU_FLAG_LPRST: low-power reset flag
      \arg        RCU_FLAG_IRC48MSTB: IRC48M stabilization flags (only for GD32F5HC)
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus rcu_flag_get(rcu_flag_enum flag)
{
    FlagStatus temp = RESET;
    /* get the rcu flag */
    if(RESET != (RCU_REG_VAL(flag) & BIT(RCU_BIT_POS(flag)))) {
        temp = SET;
    } else {
        temp = RESET;
    }
    return temp;
}

/*!
    \brief      clear all the reset flag (API_ID(0x0043U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void rcu_all_reset_flag_clear(void)
{
    RCU_RSTSCK |= RCU_RSTSCK_RSTFC;
}

/*!
    \brief      get the clock stabilization interrupt and ckm flags (API_ID(0x0044U))
    \param[in]  int_flag: interrupt and ckm flags, refer to rcu_int_flag_enum
                only one parameter can be selected which is shown as below:
      \arg        RCU_INT_FLAG_IRC32KSTB: IRC32K stabilization interrupt flag
      \arg        RCU_INT_FLAG_LXTALSTB: LXTAL stabilization interrupt flag
      \arg        RCU_INT_FLAG_IRC16MSTB: IRC16M stabilization interrupt flag
      \arg        RCU_INT_FLAG_HXTALSTB: HXTAL stabilization interrupt flag
      \arg        RCU_INT_FLAG_PLLSTB: PLL stabilization interrupt flag
      \arg        RCU_INT_FLAG_PLLI2SSTB: PLLI2S stabilization interrupt flag
      \arg        RCU_INT_FLAG_PLLDIGSTB: PLLDIG stabilization interrupt flag (only for GD32W515)
      \arg        RCU_INT_FLAG_CKM: HXTAL clock stuck interrupt flag
      \arg        RCU_INT_FLAG_IRC48MSTB : IRC48M stabilization interrupt flag (only for GD32F5HC)
      \arg        RCU_INT_FLAG_LXTALCKMIF: LXTAL clock stuck interrupt flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus rcu_interrupt_flag_get(rcu_int_flag_enum int_flag)
{
    FlagStatus temp = RESET;
    /* get the rcu interrupt flag */
    if(RESET != (RCU_REG_VAL(int_flag) & BIT(RCU_BIT_POS(int_flag)))) {
        temp = SET;
    } else {
        temp = RESET;
    }
    return temp;
}

/*!
    \brief      clear the interrupt flags (API_ID(0x0045U))
    \param[in]  int_flag: clock stabilization and stuck interrupt flags clear, refer to rcu_int_flag_clear_enum
                only one parameter can be selected which is shown as below:
      \arg        RCU_INT_FLAG_IRC32KSTB_CLR: IRC32K stabilization interrupt flag clear
      \arg        RCU_INT_FLAG_LXTALSTB_CLR: LXTAL stabilization interrupt flag clear
      \arg        RCU_INT_FLAG_IRC16MSTB_CLR: IRC16M stabilization interrupt flag clear
      \arg        RCU_INT_FLAG_HXTALSTB_CLR: HXTAL stabilization interrupt flag clear
      \arg        RCU_INT_FLAG_PLLSTB_CLR: PLL stabilization interrupt flag clear
      \arg        RCU_INT_FLAG_PLLI2SSTB_CLR: PLLI2S stabilization interrupt flag clear
      \arg        RCU_INT_FLAG_PLLDIGSTB_CLR: PLLDIG stabilization interrupt flag clear (only for GD32W515)
      \arg        RCU_INT_FLAG_CKM_CLR: clock stuck interrupt flag clear
      \arg        RCU_INT_FLAG_IRC48MSTB_CLR : IRC48M stabilization interrupt flag clear (only for GD32F5HC)
      \arg        RCU_INT_FLAG_LXTALCKMIF_CLR: LXTAL clock stuck interrupt flag clear
    \param[out] none
    \retval     none
*/
void rcu_interrupt_flag_clear(rcu_int_flag_clear_enum int_flag)
{
    RCU_REG_VAL(int_flag) |= BIT(RCU_BIT_POS(int_flag));
}


/*!
    \brief      get the peripherals clock secure flag (API_ID(0x0046U))
    \param[in]  sec_flag: secure flag, refer to rcu_sec_flag_enum
                only one parameter can be selected which is shown as below:
      \arg        RCU_SEC_FLAG_IRC16MSEC: IRC16M secure flag
      \arg        RCU_SEC_FLAG_HXTALSEC: HXTAL secure flag
      \arg        RCU_SEC_FLAG_IRC32KSEC: IRC32K secure flag
      \arg        RCU_SEC_FLAG_LXTALSEC: LXTAL clock secure flag
      \arg        RCU_SEC_FLAG_SYSCLKSEC: SYSCLK secure flag
      \arg        RCU_SEC_FLAG_PRESCSEC: PRESC secure flag
      \arg        RCU_SEC_FLAG_PLLSEC: PLL secure flag
      \arg        RCU_SEC_FLAG_PLLDIGSEC: PLLDIG secure flag (only for GD32W515)
      \arg        RCU_SEC_FLAG_PLLI2SSEC: PLLI2S secure flag
      \arg        RCU_SEC_FLAG_RMVRSTFSEC: RMVRST secure flag
      \arg        RCU_SEC_FLAG_BKPSEC: BKP secure flag
      \arg        RCU_SEC_FLAG_IRC48MSEC: IRC48M secure flag (only for GD32F5HC)
      \arg        RCU_SEC_FLAG_GPIOx:(x=A,B,C): GPIO port x security flag
      \arg        RCU_SEC_FLAG_GPIOD: GPIO port D security flag (only for GD32F5HC)
      \arg        RCU_SEC_FLAG_GTZC: GTZC security flag
      \arg        RCU_SEC_FLAG_CRC: CRC security flag
      \arg        RCU_SEC_FLAG_FMC: FMC security flag
      \arg        RCU_SEC_FLAG_WIFI: WIFI security flag
      \arg        RCU_SEC_FLAG_SRAMx: (x=0,1,2,3): SRAMx security flag
      \arg        RCU_SEC_FLAG_DMAx:(x=0,1): DMAx security flag
      \arg        RCU_SEC_FLAG_USBFS: USBFS security flag
      \arg        RCU_SEC_FLAG_DCI (not available for GD32W515TX series): DCI security flag
      \arg        RCU_SEC_FLAG_PKCAU: PKCAU security flag
      \arg        RCU_SEC_FLAG_CAU: CAU security flag
      \arg        RCU_SEC_FLAG_HAU: HAU security flag
      \arg        RCU_SEC_FLAG_TRNG: TRNG security flag
      \arg        RCU_SEC_FLAG_SQPI: SQPI security flag
      \arg        RCU_SEC_FLAG_QSPI: QSPI security flag
      \arg        RCU_SEC_FLAG_TIMERx: (x=0,1,2,3,4,5,15,16): TIMERx security flag
      \arg        RCU_SEC_FLAG_WWDGT:  WWDGT security flag
      \arg        RCU_SEC_FLAG_SPI1: SPI1 security flag
      \arg        RCU_SEC_FLAG_USARTx: (x=0,1,2): USARTx security flag
      \arg        RCU_SEC_FLAG_I2Cx: (x=0,1): I2Cx security flag
      \arg        RCU_SEC_FLAG_CTC: CTC security flag
      \arg        RCU_SEC_FLAG_PMU: PMU security flag
      \arg        RCU_SEC_FLAG_ADC: ADC security flag
      \arg        RCU_SEC_FLAG_SDIO: SDIO security flag
      \arg        RCU_SEC_FLAG_SPI0: SPI0 security flag
      \arg        RCU_SEC_FLAG_SYSCFG: SYSCFG security flag
      \arg        RCU_SEC_FLAG_HPDF: HPDF security flag
      \arg        RCU_SEC_FLAG_RF: RF security flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus rcu_security_flag_get(rcu_sec_flag_enum sec_flag)
{
    FlagStatus temp = RESET;
    /* get the rcu security flag */
    if(RESET != (RCU_REG_VAL(sec_flag) & BIT(RCU_BIT_POS(sec_flag)))) {
        temp = SET;
    } else {
        temp = RESET;
    }
    return temp;
}

/*!
    \brief      enable the stabilization interrupt (API_ID(0x0047U))
    \param[in]  interrupt: clock stabilization interrupt, refer to rcu_int_enum
                Only one parameter can be selected which is shown as below:
      \arg        RCU_INT_IRC32KSTB: IRC32K stabilization interrupt enable
      \arg        RCU_INT_LXTALSTB: LXTAL stabilization interrupt enable
      \arg        RCU_INT_IRC16MSTB: IRC16M stabilization interrupt enable
      \arg        RCU_INT_HXTALSTB: HXTAL stabilization interrupt enable
      \arg        RCU_INT_PLLSTB: PLL stabilization interrupt enable
      \arg        RCU_INT_PLLI2SSTB: PLLI2S stabilization interrupt enable
      \arg        RCU_INT_PLLDIGSTB: PLLDIG stabilization interrupt enable (only for GD32W515)
      \arg        RCU_INT_IRC48MSTB: IRC48M stabilization interrupt enable (only for GD32F5HC)
    \param[out] none
    \retval     none
*/
void rcu_interrupt_enable(rcu_int_enum interrupt)
{
    RCU_REG_VAL(interrupt) |= BIT(RCU_BIT_POS(interrupt));
}

/*!
    \brief      disable the stabilization interrupt (API_ID(0x0048U))
    \param[in]  interrupt: clock stabilization interrupt, refer to rcu_int_enum
                only one parameter can be selected which is shown as below:
      \arg        RCU_INT_IRC32KSTB: IRC32K stabilization interrupt disable
      \arg        RCU_INT_LXTALSTB: LXTAL stabilization interrupt disable
      \arg        RCU_INT_IRC16MSTB: IRC16M stabilization interrupt disable
      \arg        RCU_INT_HXTALSTB: HXTAL stabilization interrupt disable
      \arg        RCU_INT_PLLSTB: PLL stabilization interrupt disable
      \arg        RCU_INT_PLLI2SSTB: PLLI2S stabilization interrupt disable
      \arg        RCU_INT_PLLDIGSTB: PLLDIG stabilization interrupt disable (only for GD32W515)
      \arg        RCU_INT_IRC48MSTB: IRC48M stabilization interrupt disable (only for GD32F5HC)
    \param[out] none
    \retval     none
*/
void rcu_interrupt_disable(rcu_int_enum interrupt)
{
    RCU_REG_VAL(interrupt) &= ~BIT(RCU_BIT_POS(interrupt));
}
